import 'package:namazapp/features/namaz/data/interfaces/part-iterface.dart';

class AttahiyatPart implements IPart {
  String title = 'Әт-тахият';
  String description =
      "<p>Осылай отырып &laquo;әт-тахият&raquo; дұғасын оқиды.</p>";
  String image = '';
  List<String> audio = [
    "attahiat.mp3",
  ];
  String transcript =
      "<p>&laquo;Әт-тахияту лиллаһи уас-салауату уат-таййбат, әс-сәламу &rsquo;аләйка әйюһән-нәби, уә рахмәтуллаһи уә бәрәкатуһу, әс-сәламу &rsquo;аләйна уә &rsquo;ала ибәдиллаһис-салихин, әшһаду әл-лә иләһә иллаллаһ уә әшһәду әннә Мухаммәдән &rsquo;абдуһу уә расулуһ&raquo;</p>";
  String translation =
      "<p>&laquo;Барлық дұғалар, мадақтар, тәндік, дүниелік ғибадаттар Аллаға лайық. Ей, Пайғамбар! Саған сәлем. Әрі саған Алланың рақымы мен берекеті жаусын! (Ей, Раббымыз!) Сәлем бізге және Алланың салиқалы құлдарына болсын. Мен Алладан өзге ешқандай құдай жоқ екеніне және Хазіреті Мұхаммедтің Алланың құлы әрі пайғамбары екеніне куәлік етемін&raquo;.</p>";
  String arabic =
      "<p>التحيات لله والصلوات و الطيبات،<br />السلام عليك أيها النبي ورحمة الله وبركاته،<br />السلام علينا وعلى عباد الله الصالحين،<br />أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله</p>";
}
