import 'package:namazapp/features/namaz/data/interfaces/part-iterface.dart';

class KunutPart implements IPart {
  String title = 'Құнұт дұғасы';
  String description =
      'Екі қолын екі құлағына көтеріп «Аллаһу Акбар» деп «құнұт» дұғасын оқиды. Құнұт дұғасы тек үтір намазында оқылады.';
  String image = '';
  String audio = "kunt.mp3";
  String transcript =
      '«Аллаһумма инәә наста’инукә уә настағфирукә уә нәстаһдик, уә ну’мину бик, уә нәтубу иләйк, уә нәтәуәккәлу ’алайк, уә нусни ’алайкәл-хайра күлләһу нәшкурук, уә ләә нәкфурук, уә нахла’у уә нәтруку мәй-йәфжурук. Аллаһумма ииәәкә на’буд, уә ләкә нусалли уә нәсжуд, уә иләйкә нас’а уә нахфид, наржу рахмәтәк, уә нахшә ’азабәк, иннә ’азабәкә бил куффари мулхиқ»';
  String translation =
      "«Аллам, біз күмәнсіз сенен жәрдем және кешірім тілеп, сенен тура жол, һидаят сұраймыз. Саған иман етіп, күнәларымыз үшін саған тәубе етіп, саған сүйенеміз. Сені барлық жақсылықтармен мадақтап, зікір етеміз. Бізге берген ырыс-берекеңе шүкір етеміз. Сені теріске шығармаймыз. Саған қарсы келгендерді теріске шығарып, олармен мүлдем байланысымызды үземіз. Аллам! Біз тек саған ғана құлшылық етіп, сен үшін намаз оқып, саған сәжде етеміз. Саған лайық құл болып, сенің ризалығыңды алу үшін жігерленіп, қайраттанып алға ұмтыламыз. Сенің рақымдылығыңнан үміттеніп, азабыңнан қорқамыз. Күмәнсіз, сенің азабың кәпірлерді қамтиды».";
  String arabic = "";
  String rakaatName = "";
  String comment = "";
}
