import 'package:namazapp/features/namaz/data/interfaces/part-iterface.dart';

class AttahiyatSalauatPart implements IPart {
  String title = 'Әт-тахият';
  String description =
      "<p>Осылай отырып &laquo;әт-тахият&raquo; дұғасын оқиды. &laquo;Әт-тахият&raquo; дұғасы.</p><p>Салауатты оқиды.</p>";
  String image = '';
  List<String> audio = [
    "attahiat.mp3",
    "sali.mp3",
    "barik.mp3",
    "rabanna.mp3",
  ];
  String transcript =
      "<div><p>Әт-тахияту лиллаһи уас-салауату уат-таййбат, әс-сәламу &rsquo;аләйка әйюһән-нәби,<br />уәрахмәтуллаһи уә бәрәкатуһу, әс-сәламу &rsquo;аләйна уә &rsquo;ала ибәдиллаһис-салихин,<br />әшһаду әл-лә иләһә иллаллаһ уә әшһәду әннә Мухаммәдән &rsquo;абдуһу уә расулуһ</p>";
  String translation =
      "<p>&laquo;Барлық дұғалар, мадақтар, тәндік, дүниелік ғибадаттар Аллаға лайық. Ей, Пайғамбар! Саған сәлем. Әрі саған Алланың рақымы мен берекеті жаусын! (Ей, Раббымыз!) Сәлем бізге және Алланың салиқалы құлдарына болсын. Мен Алладан өзге ешқандай құдай жоқ екеніне және Хазіреті Мұхаммедтің Алланың құлы әрі пайғамбары екеніне куәлік етемін&raquo;</p>";
  String arabic =
      "<div><p>التحيات لله والصلوات و الطيبات،<br />السلام عليك أيها النبي ورحمة الله وبركاته،<br />السلام علينا وعلى عباد الله الصالحين،<br />أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله</p>" +
          "<p>اللهم صل على محمد وعلى آل محمد<br />كما صليت على إبراهيم وعلى آل إبراهيم.<br />وبارك على محمد وعلى آل محمد<br />كما باركت على إبراهيم وعلى آل إبراهيم،<br />في العالمين إنك حميد مجيد</p>" +
          "<p>رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً<br />وَفِي الآخِرَةِ حَسَنَةً<br />وَقِنَا عَذَابَ النَّارِ</p></div>";
  String rakaatName = "";
}
