import 'package:namazapp/features/namaz/data/interfaces/part-iterface.dart';

class FatihaAsrPart implements IPart {
  String title = 'Қиям';
  String description = '';
  String image = '';
  List<String> audio = [
    "fatiha.mp3",
    "asr.mp3",
  ];
  String transcript =
      '<div>Фатиха сүресі</div><p>(1) Әлхәмду лилләһи раббил-&lsquo;аләмиин<br />(2) Әр-рахманир-рахиим<br />(3) Мәлики йәумид-диин<br />(4) Иййәкә нә&lsquo;буду уәиййәкә нәстә&lsquo;иин<br />(5) Иһдинәс-сирәатал-мустақиим<br />(6) Сиратал-ләз̃иинә ән&lsquo;амтә &lsquo;аләйһим<br />(7) Ғайрил-мәғдууби &lsquo;аләйһим уәләддаллиин<br />Фатихадан кейін іштей &laquo;Әмин&raquo; дейді</p><div>&laquo;&lsquo;Аср&raquo; сүресі</div><p>(1) Уәл-&lsquo;аср<br />(2) иннәл-инсәнә ләфии хуср<br />(3) илләл-ләз̃иинә әмәнуу уә&lsquo;амилуус-салихәти уәтәуәсау бил-хаққи уәтәуәсау бис-сабр.</p>';
  String translation =
      "<div>Сура &laquo;Аль-Фатиха&raquo;</div><p>Аса қамқор, ерекше мейірімді Алланың атымен бастаймын. (1) Барлық мақтау бүкіл әлемнің Раббы Аллаға тән. (2) Аса қамқор, ерекше мейірімді. (3) Қиямет күнінің иесі. (4) Саған ғана құлшылық қыламыз, әрі Сенен ғана жәрдем тілейміз! (5) Бізді тура жолға сала көр! (6) Нығметке бөленгендеріңнің жолына! Ашуға ұшырағандардың және адасқандардың жолына емес! (7)</p><div>&laquo;&lsquo;Аср&raquo; сүресі</div><p>&laquo;Заманға серт. (1) Негізінен адам баласы зиянда. (2) Бірақ сондай иман келтіріп, ізгі іс істегендер, бір-біріне шындықты үгіттесіп, сабырды үгіттескендер; олар зиянға ұшырамайды. (3)&raquo;</p>";
  String arabic =
      "<p>الْحَمْدُ لِلَّـهِ رَبِّ الْعَالَمِينَ<br />الرَّحْمَـٰنِ الرَّحِيمِ<br />مَالِكِ يَوْمِ الدِّينِ<br />إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ<br />اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ<br />صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ<br />غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ</p><div>&laquo;&lsquo;Аср&raquo; сүресі</div><p>وَالْعَصْرِ<br />إِنَّ الْإِنسَانَ لَفِي خُسْرٍ<br />إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَتَوَاصَوْا بِالْحَقِّ وَتَوَاصَوْا بِالصَّبْرِ</p>";
}
