import 'package:namazapp/features/namaz/data/interfaces/part-iterface.dart';

class PartSuraFatiha implements IPart {
  String title = 'Фатиха сүресі';
  String description = '';
  String image = '';
  String audio = "fatiha.mp3";

  String transcript =
      '<div>Фатиха сүресі</div><p>(1) Әлхәмду лилләһи раббил-&lsquo;аләмиин<br />(2) Әр-рахманир-рахиим<br />(3) Мәлики йәумид-диин<br />(4) Иййәкә нә&lsquo;буду уәиййәкә нәстә&lsquo;иин<br />(5) Иһдинәс-сирәатал-мустақиим<br />(6) Сиратал-ләз̃иинә ән&lsquo;амтә &lsquo;аләйһим<br />(7) Ғайрил-мәғдууби &lsquo;аләйһим уәләддаллиин</p>';
  String translation =
      "<div>Сура &laquo;Аль-Фатиха&raquo;</div><p>Аса қамқор, ерекше мейірімді Алланың атымен бастаймын. (1) Барлық мақтау бүкіл әлемнің Раббы Аллаға тән. (2) Аса қамқор, ерекше мейірімді. (3) Қиямет күнінің иесі. (4) Саған ғана құлшылық қыламыз, әрі Сенен ғана жәрдем тілейміз! (5) Бізді тура жолға сала көр! (6) Нығметке бөленгендеріңнің жолына! Ашуға ұшырағандардың және адасқандардың жолына емес! (7)</p>";
  String arabic =
      "<p>الْحَمْدُ لِلَّـهِ رَبِّ الْعَالَمِينَ<br />الرَّحْمَـٰنِ الرَّحِيمِ<br />مَالِكِ يَوْمِ الدِّينِ<br />إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ<br />اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ<br />صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ<br />غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ</p>";
  String rakaatName = "";
}
