import 'package:namazapp/features/namaz/data/interfaces/part-iterface.dart';

class PartSuraFatiha implements IPart {
  String title = 'Фатиха сүресі';
  String description = '';
  String image = '';
  String audio = "fatiha.mp3";

  String transcript =
      '<p>(1) Әлхәмду лилләһи раббил-&lsquo;аләмиин<br/>(2) Әр-рахманир-рахиим<br />(3) Мәлики йәумид-диин<br />(4) Иййәкә нә&lsquo;буду уәиййәкә нәстә&lsquo;иин<br />(5) Иһдинәс-сирәатал-мустақиим<br />(6) Сиратал-ләз̃иинә ән&lsquo;амтә &lsquo;аләйһим<br />(7) Ғайрил-мәғдууби &lsquo;аләйһим уәләддаллиин</p>';
  String translation =
      "<p>(1) Барлық мақтау бүкіл әлемнің Раббы Аллаға тән.<br/> (2) Аса қамқор, ерекше мейірімді.<br/> (3) Қиямет күнінің иесі.<br/> (4) Саған ғана құлшылық қыламыз, әрі Сенен ғана жәрдем тілейміз!<br/> (5) Бізді тура жолға сала көр!<br/> (6) Нығметке бөленгендеріңнің жолына! Ашуға ұшырағандардың және адасқандардың жолына емес!</p>";
  String arabic =
      "<p>الْحَمْدُ لِلَّـهِ رَبِّ الْعَالَمِينَ<br />الرَّحْمَـٰنِ الرَّحِيمِ<br />مَالِكِ يَوْمِ الدِّينِ<br />إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ<br />اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ<br />صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ<br />غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ</p>";
  String rakaatName = "";
}
