{
  "result": "<p><strong>Намаз және оның дәлелдері</strong><br /><br />Алланың бар екендігі мен даралығын біліп растау &ndash; ең үлкен парыз. Осыдан кейінгі парыздардың ең үлкені және ең маңыздысы &ndash; намаз. Намаз &ndash; жүректің нұры, рухтың күші, мұсылманның кереметі.<br /><br />Намаз &ndash; сөздікте &laquo;дұға ету&raquo;, &laquo;жақсы дұға ету&raquo; деген мағынаны білдіреді. Алла Тағала Құранда: &laquo;Оларға дұға ет. Сенің дұғаң оларға рақымшылдық&raquo;, &ndash; дейді.<br /><br />Шариғатта намаз &ndash; тәкбірмен басталып, сәлеммен аяқталатын, ерекше қимыл-қозғалыстар мен сөздерден тұратын ғажайып ғибадат.<br /><br />Хазіреті Мұхаммедке (с.ғ.с.) бес уақыт намаз парыз етілмей тұрып, тек қана таң мен ақшам уақытында екі рет намаз оқылған. Кейін Миғраж түнінде бес уақыт намаз парыз болды. Намаздың парыздығы Құран, сүннет және ижмағ дәлелдерімен анықталған. Құранның көптеген жерінде &laquo;Намаз оқыңдар және зекет беріңдер&raquo; &ndash; деп намаздың өте маңызды парыз екендігі<br /><br />білдірілген. Олардың кейбірі мыналар: &laquo;Барлық намаздарды және орта намазды сақтаңдар&raquo;. &laquo;Расында, намаз белгіленген арнайы уақыттарда парыз етілді&raquo;. &laquo;Алайда, олар барлық бұрыс діндерден бойын аулақұстап, шынайы түрде Аллаға құлшылық етуден, намазды тұп-тура оқудан және зекет беруден өзге нәрсеге әмір етілмеген болатын&raquo;. &laquo;Намазды толық оқыңдар...&raquo;.<br /><br />Сүннеттен дәлелдер: Бұл туралы риуаят етілген көптеген хадистер бар. Бұлардың кейбіреуі: &laquo;Ибн Омардан (р.а.) риуаят етілген бір хадисте Пайғамбарымыз (с.ғ.с.) былай дейді: &laquo;Ислам бес нәрседен тұрады: Алладан басқа құдай жоқ екеніне және Мұхаммед Алланың Елшісі екеніне куәлік ету, намаз оқу, зекет беру, шамасы келсе қажылыққа бару және Рамазан оразасын ұстау&raquo;.<br /><br />Хазіреті Пайғамбар Муаз ибн Жәбәлді (р.а.) Йеменге жіберіп жатқанда, оған былай дейді: &laquo;Сен әһли кітап саналған қоғамға бара жатырсың. Оларды алдымен Аллаға құлшылық етуге шақыр, Алланы қабыл етсе, Алланың оларға бір күнде бес уақыт намаз парыз еткенін айт. Намазды қабыл етсе, Алла Тағаланың олардың ауқатты жандарына кедейлерге беру үшін зекет парыз еткенін айт. Қабыл етсе, олардан зекет ал. Бірақ адамдардың мал-мүлкінің ең жақсысын алма, жәбір көргеннің қарғысынан сақтан. Өйткені, оның дұғасы мен Алла Тағаланың арасында перде жоқ&raquo;.<br /><br />Сонымен қатар, күллі Ислам ғалымдарында бір күнде бес уақыт намаздың парыздығы жайлы бір ауыздан құптаушылық бар. Намаздың һижреттен (көш) бұрын Миғраж түнінде парыз болғаны жайлы нақты хабарлар бар. Әнас (р.а.) жеткізген бір хадисте айтылады: &laquo;Миғраж түнінде Хазіреті Пайғамбарға елу уақыт намаз парыз етілген, кейін азайтып беске түсірді. Сол кезде Алла Тағала былай деді: &laquo;Ей, Мұхаммед! Менің сөзім өзгермес. Бес уақыт намазда сен үшін елу уақыт намаздың сауабы бар&raquo;.<br /><br />Намаз балиғат жасына жеткен, ақылы толысқан әрбір мұсылманға парыз. Бірақ жеті жасқа келген балаларға намаз оқуды үйрету керек. Пайғамбарымыз (с.ғ.с.) былай дейді: &laquo;Балаларға жеті жасқа келгенде намаз оқытыңдар, он жасына келгенде (намаз оқымаса жай) ұрыңдар және сол жаста төсегін бөлек салып беріңдер&raquo;.<br /><br />Бір күнде мұсылмандарға бес уақыт намаз &ndash; парыз. Атау (нәзір), үтір, және айт намаздары &ndash; уәжіп. Бір бәдәуи (шөл адамы) жайлы хадисте намаздың бес уақыт екені айтылады. Пайғамбарымыз (с.а.у.): &laquo;Бір күннің ішінде парыз етілген намаз бесеу&raquo;, &ndash; дейді. Бәдәуи сонда: &laquo;Менің бұдан басқа борышым бар ма?&raquo;, &ndash; деп сұрағанда, Алла Елшісі: &laquo;Жоқ, егер өздігіңнен нәпіл намаз оқысаң, ол басқа&raquo;, &ndash; деп жауап қайтарады. Сонда бәдәуи: &laquo;Сені ақиқатпен жіберген Аллаға ант етемін. Бұдан басқа не артық, не кем намаз оқымаймын&raquo;, &ndash; деді. Сонда Пайғамбарымыз (с.ғ.с.): &laquo;Сөзі рас болса, ол адам жәннатқа барады&raquo;.</p>"
}